---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.IFC.IFCFileWriteOptions
source: html/53a4a339-c186-7fe3-ad0e-4d4c5ae2aa83.htm
---
# IFCFileWriteOptions Members

Creates a default IFCFileWriteOptions. The default file format is ifc.